<a href="https://colab.research.google.com/github/yohanesnuwara/RandomCoolStuffs/blob/master/Pandas_SettingsCopyWarning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Editing entries in Pandas dataframe is very common. However it often comes into a very typical error, "SettingsWithCopyWarning", that is really bugging. This is a solution I get from [Stackoverflow](https://stackoverflow.com/questions/20625582/how-to-deal-with-settingwithcopywarning-in-pandas)

In [4]:
import numpy as np
import pandas as pd

# Make dataframe
df = pd.DataFrame([[1,'William',10,np.nan],[2,'William',20,np.nan],[3,'Brown',30,np.nan],[4,'Cindy',40,np.nan]], 
                  columns=['var1','var2','var3','var4'])

df

   var1     var2  var3  var4
0     1  William    10   NaN
1     2  William    20   NaN
2     3    Brown    30   NaN
3     4    Cindy    40   NaN

I want to edit the entries in the column "var4" that all currently has NaN. For all the names in column "var2" that is "William", I want to put 999 in column "var4". If we do like this:

In [5]:
(df[df.var2=="William"]).var4 = 999

df

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:5170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

   var1     var2  var3  var4
0     1  William    10   NaN
1     2  William    20   NaN
2     3    Brown    30   NaN
3     4    Cindy    40   NaN

It returns "SettingWithCopyWarning" and the entry won't update. The solution is as follows:

In [6]:
df.loc[(df.var2=="William"), 'var4'] = 999

df

   var1     var2  var3   var4
0     1  William    10  999.0
1     2  William    20  999.0
2     3    Brown    30    NaN
3     4    Cindy    40    NaN

And it works. Remember to use: 

`df.loc[(your_conditional), 'column_to_edit']=new_value`

Also for example, for Brown and Cindy, var4 want to be 1010 and 123.

In [7]:
name = ['William', 'Brown', 'Cindy']
val = [999, 1010, 123]

for i in range(len(name)):
  df.loc[df.var2==name[i], 'var4'] = val[i]

df

   var1     var2  var3    var4
0     1  William    10   999.0
1     2  William    20   999.0
2     3    Brown    30  1010.0
3     4    Cindy    40   123.0